# frozen_string_literal: true

module Hontynoo
  module Explain
    def explainations
      { 
        ("06:00"..."07:30") => [
          {
            period: "วันอาทิตย์ ยามที่ 1 ยามนคร ยามสุริชะ",
            period_en: "Sunday 7",
            poem: "สุริชะ รุ่งอรุณแดดอุ่นอ่อน เมื่อวานรเนรคุณลิงรุ่นจิ๋ว
  เห็นรังนกกระจาบบนปลายงิ้ว ก็ไพล่พลิ้วเข้าอาศัยอยู่ในรัง",
            meaning: "ระวังคนแปลกหน้าเข้ามาไม่รู้จุดประสงค์",
            meaning_en: "Strangers and their uncleared motive."
          },
          {
            period: "วันจันทร์ ยามที่ 1 ยามนคร ยามจันเทา",
            period_en: "Monday 1",
            poem: "จันเทา รุ่งสว่างกระจ่งแจ้ง สุริแสงส่องฟ้าสุธาสถาน
  ได้เมื่อเจ้าโฆษกกุมาร เกิดในครรภ์จัณฑาลทรพล",
            meaning: "เป็นยามก้ำกึ่ง ได้ของมาแต่เป็นของไม่ดี หรือ ทั้งได้และเสีย",
            meaning_en: "Bad in good time. recieved things but poor quality. or recieved but also lost"
          },
          {
            period: "วันอังคาร ยามที่ 1 ยามนคร ยามภุมมะ",
            period_en: "Tuesday 2",
            poem: "ภุมมะ รุ่งสว่างกระจ่างหลาย ดีกับร้ายกึ่งกันจะผันหา
  ได้เมื่อพ่อกระบือชื่อทรพา อยู่ในป่าตัวเดียวเที่ยวกระเจิง",
            meaning: "เป็นยามดีร้าย ก้ำกึ่งกัน",
            meaning_en: "Half bad/good."
          },
          {
            period: "วันพุธ ยามที่ 1 ยามยายี ยามพุธะ",
            period_en: "Wednesday 3",
            poem: "พุธะ ได้เมื่อพระฉัตทันต์ จากสวรรค์มาเกิดในไพรระหง
  เป็นใหญ่กว่าฝูงช้างในกลางดง พระองค์ทรงศิลาบารมี",
            meaning: "เป็นยามดี ต่อไปจะมีอำนาจ บารมี",
            meaning_en: "Good time. fortune and prestige"
          },
          {
            period: "วันพฤหัส ยามที่ 1 ยามนคร ยามครู",
            period_en: "Thursday 4",
            poem: "ครู ยามรุ่งอรุณอบอุ่นจิต เป็นนิมิตยามดีมหาศาล
  เป็นยามของบัณฑิตใช่จิตพาล ดุลวิกาลจากไปไสวมา",
            meaning: "เป็นยามดี เป็นยามของผู้มีความรู้",
            meaning_en: "Good time. especially for those needing more knowledge"
          },
          {
            period: "วันศุกร์ ยามที่ 1 ยามยายี ยามศุกระ",
            period_en: "Friday 5",
            poem: "ศุกระ ยามมหาสถาผล พระสุธนมากำเนิดสนอง
  เป็นกษัตริย์ฟุ้งเฟื่องอันเรืองรอง ได้ครอบครองสมบัติสวัสดี",
            meaning: "เป็นยามดีมาก",
            meaning_en: "BEST TIME"
          },
          {
            period: "วันเสาร์ ยามที่ 1 ยามนคร ยามเสารี",
            period_en: "Saturday 6",
            poem: "เสารี กำลังดังช้างสาร กำแหงหาญฤทธานั้นปรากฏ
  ได้เมื่ออักขะโมขีมีพยศ เป็นกำหนดให้ยามตามเรื่องราว",
            meaning: "เป็นยามดี มีความสามารถมาก",
            meaning_en: "Good time, working with high ability"
          },
        ],

        ("07:30"..."09:00") => [
          {
            period: "วันอาทิตย์ ยามที่ 2 ยามนคร ยามศุกระ",
            period_en: "Sunday 6",
            poem: "ศุกระ ไอ้ลิงไพรใจโกหก ลวงให้นกรักใคร่เหมือนใจหวัง
  จนปักษีมีไข่มิได้ระวัง เพราะเชื่อฟังลมลิงไม่กริ่งใจ",
            meaning: "จะมีคนมาพูดจาเล่นลิ้น หลอกลวง อย่าเชื่อ",
            meaning_en: "Untruthful personal, do not trust any words."
          },
          {
            period: "วันจันทร์ ยามที่ 2 ยามนคร ยามเสารี",
            period_en: "Monday 7",
            poem: "เสารี ว่าแม่แค่คลอดบุตร ก็แสนสุดยากไร้ไม่เป็นผล
  ร้อนรุ่มกลุ้มอกยกลูกตน ไปเสือกสนซ่อนไว้ในที่รก",
            meaning: "เป็นยามไม่ดี",
            meaning_en: "Worst time"
          },
          {
            period: "วันอังคาร ยามที่ 2 ยามยายี ยามสุริชะ",
            period_en: "Tuesday 1",
            poem: "สุริชะ ได้เมื่อบริวาร แสนสำราญเริงโลดกระโดดเหลิง
  เกิดกำลังตั้งท่าทำร่าเริง เที่ยวแบะเบิ่งเป็นใหญ่ในหมู่ควาย",
            meaning: "เป็นยามดี จะได้รับชัยชนะ มีชื่อเสียง",
            meaning_en: "Good time. recieve the victory and famous"
          },
          {
            period: "วันพุธ ยามที่ 2 ยามนคร ยามจันเทา",
            period_en: "Wednesday 2",
            poem: "จันเทา นางเช้าก็แวดล้อม สะพรั่งพร้อมเป็นขนัดล้วนหัตถี
  อยู่เป็นสุขทุกทิวาและราตรี มิได้มีภยันอันตราย",
            meaning: "เป็นยามดี ได้บริวารดี เดินทางสะดวกปลอดภัย",
            meaning_en: "good time. meet good people and smooth and safe journey"
          },
          {
            period: "วันพฤหัส ยามที่ 2 ยามยายี ยามภุมมะ",
            period_en: "Thursday 3",
            poem: "ภุมมะ พระได้เสวยราชย์ เอกราชฦาเลื่องเรื่องสนาม
  แต่รูปทรงของพระองค์ไม่สู้งาม ตำรายามนี้ว่าดีดังมีมา",
            meaning: "เป็นยามดี จะได้ลาภยศบรรดาศักดิ์",
            meaning_en: "Good time. raising the title and ranking"
          },
          {
            period: "วันศุกร์ ยามที่ 2 ยามนคร ยามพุธะ",
            period_en: "Friday 4",
            poem: "พุธะ พระได้มโนเรศ เป็นปิ่นเกษไกรราชบุรีศรี
  โฉมสำอางนางฟ้ากุมารี พระภูมีชื่นชมภิรมย์ทรวง",
            meaning: "เป็นยามดี จะประสบความสำเร็จ",
            meaning_en: "Good time with success at everything"
          },
          {
            period: "วันเสาร์ ยามที่ 2 ยามยายี ยามครู",
            period_en: "Saturday 5",
            poem: "ยามครูพบพราหมณ์เอาเป็นผัว จำแลงตัวกรุ้งกริ้งเป็นหญิงสาว
  บำเรอรักภักดีไม่มีคราว ทุกค่ำเช้าชมชิดสนิทนอน",
            meaning: "เป็นยามดีทางหาคู่ แต่อาจจะโดนคนหลอกลวงได้",
            meaning_en: "good time for finding lover but beware of fraud"
          },
        ],
        
        ("09:00"..."10:30") => [
          {
            period: "วันอาทิตย์ ยามที่ 3 ยามยายี ยามพุธะ",
            period_en: "Sunday 4",
            poem: "พุธะ ไอ้ลิงป่าอุลามก เห็นไข่นกนึกหมายน้ำลายไหล
  เอาขึ้นจูบลูบคลำแล้วกำไว้ อยากจะใคร่ได้กินแลบลิ้นเลีย",
            meaning: "มีการลักลอบ สืบความลับ หรือ คิดไม่ซื่อ ให้ระวังทรัพย์สิน",
            meaning_en: "Facing a spy or unfaithful personal, becareful of lost of properties."
          }, 
          {
            period: "วันจันทร์ ยามที่ 3 ยามนคร ยามครู",
            period_en: "Monday 5",
            poem: "ครู ผู้เศรษฐีมาพบเข้า ก็อุ้มเอาอิงแอบไว้แนบอก
  เลี้ยงเป็นบุตรสุดสวาทในทารก ก็ยอมยกสมบัติให้ครอบครอง",
            meaning: "จะมีคนช่วยเหลือคอยอุปถัมภ์ จะได้ลาภไม่คาดฝัน",
            meaning_en: "supporters are arriving, unexpected fortune."
          },
          {
            period: "วันอังคาร ยามที่ 3 ยามนคร ยามศุกระ",
            period_en: "Tuesday 6",
            poem: "ศุกระ ยามนี้เมื่อมีบุตร มารดาสุดรักใคร่ไม่ขยาย
  สู้ถนอมกล่อมเกลี้ยงเลี้ยงลูกชาย เที่ยวหย่อนกายกลัวพ่อทรพา",
            meaning: "เป็นยามร้าย จะมีคนคิดร้าย หรือ เกิดการหลอกลวง แต่ถ้าหากหลบหนีจะปลอดภัย",
            meaning_en: "Bad time. Backstabber, cheater is coming. run away is safer."
          },
          {
            period: "วันพุธ ยามที่ 3 ยามยายี ยามเสารี",
            period_en: "Wednesday 7",
            poem: "เสารี นี้ได้จุลสุพัตรา ผูกเวลาอาฆาตดังมาดหมาย
  ปองจะฆ่าพระยาฉัตทันต์ตาย เป็นยามร้ายศัตรูมักดูแคลน",
            meaning: "เป็นยามร้าย จะถูกศัตรูทำร้าย",
            meaning_en: "Bad time. Enemy is waiting ahead"
          },
          {
            period: "วันพฤหัส ยามที่ 3 ยามนคร ยามสุริชะ",
            period_en: "Thursday 1",
            poem: "สุริชะ พระมเหษี ชื่อประภาวดีเสน่หา
  ประคองเคียงเพียงดวงนัยนา ครองพาราเป็นสุขสนุกสบาย",
            meaning: "เป็นยามดี จะมีลาภ",
            meaning_en: "Good time. Winning good fortune."
          },
          {
            period: "วันศุกร์ ยามที่ 3 ยามยายี ยามจันเทา",
            period_en: "Friday 2",
            poem: "จันเทา เยาวเรศเมื่อเหตุมี พบฤาษีนางสั่งถึงวังหลวง
  ว่าเศร้าโศกโศกาน้ำตาร่วง ดุจดวงหทัยจะใหลหลง",
            meaning: "เป็นยามไม่ดี จะมีทุกข์",
            meaning_en: "Bad time. Joylessness is coming"
          },
          {
            period: "วันเสาร์ ยามที่ 3 ยามนคร ยามภุมมะ",
            period_en: "Saturday 3",
            poem: "ภุมมะ เกิดบุตรอันสุดรัก ชื่นบุญญลักษณ์เรืองฤทธิ์มหิศร
  สุขเกษมเปรมปราสถาพร ยังไม่จรจากสถานของมารดา",
            meaning: "เป็นยามดี จะได้ลาภ ได้บริวาร",
            meaning_en: "Good time for money and friends"
          },
        ],

        ("10:30"..."12:00") => [
          {
            period: "ยามจันเทา (10:30-12:00)",
            period_en: "Sunday 2",
            poem: "จันเทา เอาไข่เข้าใส่ปาก กระโดดจากต้นงิ้วพลิ้วไปเสีย
  แล้วซ่อนตัวกลัววิหคนกตัวเมีย เอามือเกลี่ยกลบไข่ให้ลี้ลับ",
            meaning: "ระวังคนที่มาอาศัยอยู่ด้วยจะหักหลัง หรือ ขโมยข้าวของในบ้าน",
            meaning_en: "Beware of belonging, the betrayers or thieves are from inside the house."
          }, 
          {
            period: "วันจันทร์ ยามที่ 4 ยามยายี ยามภุมมะ",
            period_en: "Monday 3",
            poem: "ภุมมะ ฝ่ายเศรษฐีกลับพิโรธ กระทำโทษเฆี่ยนขับให้อับหมอง
  เป็นยามร้ายจงจำในทำนอง ท่านหมายปองทำร้ายเอาปลายมือ",
            meaning: "จะมีโทษ ถ้ามีคดีความจะแพ้คนพาล หรือบริวารให้โทษ",
            meaning_en: "Lost the lawsuit to bad, being convicted"
          },
          {
            period: "วันอังคาร ยามที่ 4 ยามยายี ยามพุธะ",
            period_en: "Tuesday 4",
            poem: "พุธะ ชนนีพาหนีไกล เข้าป่าไม้ให้อยู่ในคูหา
  เป็นยามดีหนีภัยได้รอดมา เทวดาช่วยบำรุงผดุงงาน",
            meaning: "เป็นยามดี ในทางหลบหนี จะพ้นภัย",
            meaning_en: "Good for runaway, it's safer"
          },
          {
            period: "วันพุธ ยามที่ 4 ยามนคร ยามครู",
            period_en: "Wednesday 5",
            poem: "ครู นางผู้มเหสีไม่สร่างโศก บังเกิดโรคในทรวงเพราะหวงแหน
  อกแตกตายวายชีวงในดงแดน ยามนี้แสนสุดร้ายไม่อุดม",
            meaning: "เป็นยามร้าย หากถามถึงการเจ็บป่วย จะถึงตาย",
            meaning_en: "Bad time. sickness can be fatal"
          },
          {
            period: "วันพฤหัส ยามที่ 4 ยามยายี ยามศุกระ",
            period_en: "Thursday 6",
            poem: "ศุกระ ประภาวดีเธอหนีหาย ไปบุรีบิตุเรศอันเรืองฉาย
  กุศราชร้อนใจไม่สบาย เป็นยามร้ายร้อนรนพ้นประมาณ",
            meaning: "เป็นยามร้าย ถ้าของหายจะไม่ได้ข่าว",
            meaning_en: "Bad time. All lost can not be found."
          },
          {
            period: "วันศุกร์ ยามที่ 4 ยามนคร ยามเสารี",
            period_en: "Friday 7",
            poem: "เสารี สามีเที่ยวตามหา แสนโศกามาในไพรระหง
  ถึงอาศรมฤาษีที่กลางดง พระโฉมยงไต่ถามพระสิทธา",
            meaning: "เป็นยามไม่ดี มีความทุกข์ ถ้าของหายไป ยังไม่ได้คืน",
            meaning_en: "Bad time. Suffering is occuring. Lost properties are not returned"
          },
          {
            period: "วันเสาร์ ยามที่ 4 ยามยายี ยามสุริชะ",
            period_en: "Saturday 1",
            poem: "สุริชะ ลักพาบิดาหนี ข้ามคีรีห้วยธารละหานผา
  ไม่รอรั้งตั้งแต่จะรีบมา ยามนี้พากันหนีดีสุดใจ",
            meaning: "เป็นยามดีเหมาะแก่การหลบหนี",
            meaning_en: "Good time to get away"
          }, 
        ],

        ("12:00"..."13:30") => [
          {
            period: "วันอาทิตย์ ยามที่ 5 ยามยายี ยามเสารี",
            period_en: "Sunday 7",
            poem: "เสารีสกุณีไม่เห็นไข่ ก็สงสัยลิงจุ่นหมุนไปจับ
  พบลิงไพรถามไถ่ก็ไม่รับ ทุ่มเถียงกับนกกระจาบถึงหยาบคาย
  ",
            meaning: "ของหายไป ได้แต่สงสัย ยังจับใครไม่ได้ และยังไม่เจอของกลาง",
            meaning_en: "Lost of properties with number of suspects. But nothing has found nor known thief."
          }, 
          {
            period: "วันจันทร์ ยามที่ 5 ยามนคร ยามสุริชะ",
            period_en: "Monday 1",
            poem: "สุริชะ ยามนี้เศรษฐีใช้ เป็นความในลึกลับกับหนังสือ
  หมายจะให้วายวางกลางไฟฮือ เจ้าโฆสกถือหนังสือวิ่งตื๋อพลัน",
            meaning: "มีผู้คิดไม่ซื่อ ลอบทำร้าย หรือ มีการวางแผนใส่ร้ายป้ายสี ห้ามเดินทาง จะเกิดอันตราย",
            meaning_en: "Being stabed in the back, being accused. Any journey is bring bad luck"
          },
          {
            period: "วันอังคาร ยามที่ 5 ยามยายี ยามจันเทา",
            period_en: "Tuesday 2",
            poem: "จันเทา ทรพีนั้นมีฤทธิ์ ออกเที่ยวขวิดภูผาโกลาหล
  เที่ยววัดรอยพ่อดูจะสู้ชน แม้ตกยามนี้คนคิดร้ายเมื่อปลายมือ",
            meaning: "เป็นยามร้าย หากเดินทาง จะมีคนคิดปองร้ายในปลายทาง",
            meaning_en: "Bad time. A journey with bad ending"
          },
          {
            period: "วันพุธ ยามที่ 5 ยามยายี ยามภุมมะ",
            period_en: "Wednesday 3",
            poem: "ภุมมะ จุลสุพัตรวิบัติแล้ว เป็นนางแก้วบุตรหม่อมจอมสนม
  มีสมบัติพัสถานสำราญรมย์ นางก็ชมเชยชื่นทุกคืนวัน",
            meaning: "เป็นยามดี จะได้ลาภทรัพย์สมบัติ",
            meaning_en: "Good time. A large sum of fortune is coming"
          },
          {
            period: "วันพฤหัส ยามที่ 5 ยามนคร ยามพุธะ",
            period_en: "Thursday 4",
            poem: "พุธะ ยามพุธพระกุศราช ไปตามนาฎถึงประเทศเขตสถาน
  ได้พบองค์นงเยาว์ลำเภาพาล แต่ภูบาลมิได้เข้าใกล้นาง",
            meaning: "เป็นยามดี หากของหาย จะได้ข่าว แต่ยังไม่ได้คืน",
            meaning_en: "Good time. Lost properties will be known but not yet recieved"
          },
          {
            period: "วันศุกร์ ยามที่ 5 ยามยายี ยามครู",
            period_en: "Friday 5",
            poem: "ครู บาตาฤาษีก็ชี้ช่อง ดังทำนองนางสั่งไม่กังขา
  พระจดจำถ้อยคำแล้วอำลา ยามนี้หนาลำบากต้องจากกัน",
            meaning: "ได้ข่าว แต่ได้รับข่าวด้วยความยากลำบาก",
            meaning_en: "news come slowly and difficulty"
          }, 
          {
            period: "วันเสาร์ ยามที่ 5 ยามนคร ยามศุกระ",
            period_en: "Saturday 6",
            poem: "ศุกระ มาปะแม่น้ำกว้าง ยืนอยู่ข้างมหาชลาไหล
  เป็นยามดีหนีรอดตลอดไป ไม่มีภัยแผ้วพาลสำราญกา",
            meaning: "เป็นยามดี หนีรอดปลอดภัย",
            meaning_en: "Good time for safe runaway"
          }, 
        ],

        ("13:30"..."15:00") => [
              {
            period: "วันอาทิตย์ ยามที่ 6 ยามนคร ยามครู",
            period_en: "Sunday 5",
            poem: "ครู บาตาปะโสพิพากษา ว่ามืงมาอาศัยไข่เขาหาย
  บอกจริงๆลิงจุ่นอย่าวุ่นวาย ลิงผู้ร้ายกลับเถียงขึ้นเสียงดัง
  ",
            meaning: "รู้ตัวคนทำผิด แต่ยังไม่พบของที่หายไป",
            meaning_en: "Known the thief but still lost of properties."
          }, 
          {
            period: "วันจันทร์ ยามที่ 6 ยามยายี ยามศุกระ",
            period_en: "Monday 6",
            poem: "ศุกระ วิ่งมาปะบุตรท่านเศรษฐี เป็นยามดีชีวาไม่อาสัญ
  บุตรเศรษฐีกลับตายวายชีวัน เจ้าโฆสกผันผายขึ้นเรือนตน",
            meaning: "เป็นยามดี จะมีผู้ช่วยเหลือให้พ้นภัยอันตราย แต่อย่าไปช่วยคนอื่น จะเกิดความเดือดร้อน",
            meaning_en: "Good time, with supporters. However, do not help others, it's bring you trouble"
          },
          {
            period: "วันอังคาร ยามที่ 6 ยามนคร ยามเสารี",
            period_en: "Tuesday 7",
            poem: "เสารี ทรพีไม่ย่อท้อ ก็สู้พ่อขวิดได้ไม่ใช่หรือ
  เป็นยามร้ายร้อนใจดังไฟฮือ มักกลัวมือแพ้คนทุพลพาล",
            meaning: "เป็นยามร้าย กระวนกระวายร้อนใจ อยู่ไม่สุข และจะแพ้คนพาลคิดร้าย",
            meaning_en: "Bad time. Anxious, worry and lost to bad guy"
          },
          {
            period: "วันพุธ ยามที่ 6 ยามยายี ยามสุริชะ",
            period_en: "Wednesday 1",
            poem: "สุริชะ นางกษัตริย์จึงตรัสถาม จงใคร่นอนทแท่นงานอันเฉิดฉัน
  ชะอ้อนวอนบิดาแล้วจาบัลย์ ด้วยเวลามาทันให้บันดาล",
            meaning: "เป็นยามไม่ดี",
            meaning_en: "worst time"
          },
          {
            period: "วันพฤหัส ยามที่ 6 ยามยายี ยามจันเทา",
            period_en: "Thursday 2",
            poem: "จันเทา ท้าวไทยพิไรร่ำ ทุกคืนค่ำศรดสลดหมาง
  ไม่สู้ดียามนี้เป็นปานกลาง มักจักร้างแรมรักประจักษ์ใจ",
            meaning: "เป็นยามปานกลาง จะพลัดพราก",
            meaning_en: "Not good/bad but lost to love one"
          },
          {
            period: "วันศุกร์ ยามที่ 6 ยามนคร ยามภุมมะ",
            period_en: "Friday 3",
            poem: "ภุมมะ พระรีบไปดังใจหวัง ขึ้นขี่หลังนกใหญ่ข้ามไพรสณฑ์
  ถึงไกรลาศยาตรเยื้องจรจรัล ข้ามเขตขัณฑสีมายังธานี",
            meaning: "เป็นยามดี เดินทางสะดวกปลอดภัย",
            meaning_en: "Good time to make a journey"
          },
          {
            period: "วันเสาร์ ยามที่ 6 ยามนคร ยามพุธะ",
            period_en: "Saturday 4",
            poem: "พุธะ นางยักษ์ประจักษ์เหตุ ชลเนตรคลอคลองลงนองสาย
  ไปตามลูกกับผัวแทบตัวตาย เป็นยามร้ายหมายจำเอาทำนอง",
            meaning: "เป็นยามไม่ดี ข้าวของเสียหาย ไม่ได้คืน ระวังจะสูญเสียของรัก มีความเศร้าโศก",
            meaning_en: "Bad time. Damaging or lost properties. Separate to lovers. Having sadness"
          }, 
        ],

        ("15:00"..."16:30") => [
              {
            period: "วันอาทิตย์ ยามที่ 7 ยามยายี ยามภุมมะ",
            period_en: "Sunday 3",
            poem: "ภุมมะ พระสิทธาคว้าเชือกเถา มัดลิงเข้าศอกชิดติดสันหลัง
  จึงคืนไข่ให้กระจาบคาบไปรัง แต่ลิงยังไม่พ้นทรมาน",
            meaning: "หากของหาย จะเกิดการทุ่มเถียงเป็นความ แต่ทายว่าต่อไปจะได้คืน",
            meaning_en: "If anything has lost, there will be argument/fight but it will be found."
          }, 
          {
            period: "วันจันทร์ ยามที่ 7 ยามนคร ยามพุธะ",
            period_en: "Monday 4",
            poem: "พุธะ เศรษฐีสิ้นชีวิต ถึงอนิจกรรมขัดวิบัติผล
  อีกสมบัติพัสถานทั้งข้าคน ไม่ชอบกลยาตราเป็นราคี",
            meaning: "หากเดินทางจากบ้าน จะเกิดความลำบากทุกข์ยาก จะสูญเสียของอันเป็นที่รัก",
            meaning_en: "A journey away from home bring bad luck, lost of love one."
          },
          {
            period: "วันอังคาร ยามที่ 7 ยามยายี ยามครู",
            period_en: "Tuesday 5",
            poem: "พอยามครูทรพาก็อาสัญ ด้วยลูกมันคิดขับดับสังขาร
  ร้ายหนักหนาสารพันจะบันดาล แม้นทำการยามนี้ชีวาวาย",
            meaning: "เป็นยามร้าย จะแพ้ภัยคนใกล้ตัว",
            meaning_en: "Bad time. Lost to close people."
          },
          {
            period: "วันพุธ ยามที่ 7 ยามนคร ยามศุกระ",
            period_en: "Wednesday 6",
            poem: "ศุกระ พรานไพรน้ำใจกล้า รับอาสาท้าวไทยเข้าไพรสาณฑ์
  เป็นยามดีได้สมอารมณ์พราน ไปพบพานโพธิสัตว์พระฉัตทันต์",
            meaning: "เป็นยามดี เดินทางไปจะได้ลาภ ประสบความสำเร็จในการงาน",
            meaning_en: "Good time. Journey to success and fortune"
          },
          {
            period: "วันพฤหัส ยามที่ 7 ยามยายี ยามเสารี",
            period_en: "Thursday 7",
            poem: "เสารี กุศราชชนะศึก ก็สมนึกยินดีจะมีไหน
  ทำสงครามยามนี้ต้องมีชัย จงจำไว้เป็นอย่างอย่าคลางแคลง",
            meaning: "เป็นยามดีมาก ถ้ามีคดีความ จะชนะความ หากแข่งขันจะชนะ",
            meaning_en: "Good time. Winning the lawsuit or any competition"
          },
          {
            period: "วันศุกร์ ยามที่ 7 ยามนคร ยามสุริชะ",
            period_en: "Friday 1",
            poem: "สุริชะ มาปะเมื่อนางสรง จึงให้ธำมรงค์อันเรืองศรี
  นางเห็นองค์บดินทร์ก็ยินดี กินรีสอดดูพระกุมาร",
            meaning: "เป็นยามดี เหมาะกับความรัก",
            meaning_en: "Good time for love"
          },
          {
            period: "วันเสาร์ ยามที่ 7 ยามนคร ยามจันเทา",
            period_en: "Saturday 2",
            poem: "จันเทา นางก็ถึงซึ่งพินาศ โอรสราชทดแทนพระคุณสนอง
  ไม่สู้ดียามนี้มักขัดข้อง นางจึงต้องมรณาชีวาวาย",
            meaning: "เป็นยามตาย ระวังอันตรายถึงชีวิต",
            meaning_en: "Death period. Beware of danger."
          }, 
        ],

        ("16:30"..."18:00") => [
          {
            period: "วันอาทิตย์ ยามที่ 8 ยามสุริชะ",
            period_en: "Sunday 1",
            poem: "สุริชะ พระฤาษีจึงร้องว่า ทีนี้อย่าโว้เว้อ้ายเดรฉาน
  แล้วปล่อยลิงวิ่งโผนโจนทะยาน ไปสำราญอยู่ที่ลำเนาดง",
            meaning: "ถ้ามีเรื่องเป็นความ จะยอมความได้ และไม่มีโทษ",
            meaning_en: "If an argument turns to lawsuit, it will be dropped, without punishing"
          }, 
          {
            period: "วันจันทร์ ยามที่ 8 ยามจันเทา",
            period_en: "Monday 2",
            poem: "จันเทา เจ้ากุมารโฆสก ได้ป้องปกสมบัติแทนเศรษฐี
  มีเงินทองบ่าวไพร่ได้เป็นดี อยู่แทนที่เศรษฐีสำราญ",
            meaning: "จะได้ลาภลอย ไม่คาดฝัน หรือ ได้รับการอุปถัมภ์ค้ำจุน",
            meaning_en: "Unexpected fortune, or supporter"
          },
          {
            period: "วันอังคาร ยามที่ 8 ยามภุมมะ",
            period_en: "Tuesday 3",
            poem: "ภุมมะ ทรพีแทนที่พ่อ ในใจคอสำราญบานขยาย
  ตั้งตัวเป็นใหญ่ในฝูงควาย แสนสบายเปรมปรีดิ์ยินดีครัน",
            meaning: "เป็นยามร้าย ห้ามทำการ ทำสิ่งใดจะล้มเหลว เจ็บป่วย หรือ ตาย บริวารจะทรยศ",
            meaning_en: "worst time. failure, sickness, dead and backstabber are expected"
          },
          {
            period: "วันพุธยามที่ 8 ยามพุธะ",
            period_en: "Wednesday 4",
            poem: "พุธะ โพธิสัตว์ก็เลื่อยงา ประทานมาให้พรานขมีขมัน
  แล้วพระองค์มรณะในป่าวัน ในยามนั้นต้องห้ามเป็นยามตาย",
            meaning: "เป็นยามร้าย ต้องห้าม",
            meaning_en: "Worst time. DO NOT DO ANYTHING"
          },
          {
            period: "วันพฤหัส ยามที่ 8 ยามครู",
            period_en: "Thursday 5",
            poem: "ยามครูนี้ดีสุดกุศราช เสวยราชย์ดีทั่วกลัวทุกแห่ง
  สมดังจิตคิดไว้มิได้แคลง กุศลแต่งให้ได้ดีมีบุญญา",
            meaning: "เป็นยามดีมาก ทำอะไรก็จะประสบความสำเร็จ",
            meaning_en: "Good time, anything will be succeed"
          },
          {
            period: "วันศุกร์ ยามที่ 8 ยามศุกระ",
            period_en: "Friday 6",
            poem: "ศุกระ พระได้เสวยสุข นิราศทุกข์สุขโขสโมสร
  ได้นางคืนชื่นจิตสนิทนอน สถาพรพูนสวัสดิ์อยู่อัตรา",
            meaning: "เป็นยามดี ได้ทุกอย่างตามที่ต้องการ",
            meaning_en: "Good time with success at everything"
          },
          {
            period: "วันเสาร์ ยามที่ 8 ยามเสารี",
            period_en: "Saturday 7",
            poem: "เสารี ได้เมื่อลูกรัก เจริญศักดิ์โสภาจะหาไหน
  ได้ครอบครองธานีไม่มีภัย สำราญใจทุกวันนิรันดร",
            meaning: "เป็นยามดี จะมีโชค ไม่มีอันตราย",
            meaning_en: "Good time, lucky and no danger"
          }, 
        ],

        ("18:00"..."19:30") => [
          {
            period: "คืนวันอาทิตย์ ยามที่ 1 ยามนคร ยามรวิ",
            period_en: "Sunday 1",
            poem: "ระวิ ยามงามเลิศประเสริฐสรรพ ตามฉบับบอกไว้อย่าใหลหลง
  มโหสถคิดอ่านการณรงค์ ขุดอุโมงค์เข้าเมืองจุลนี",
            meaning: "มีการวางแผนการณ์ ที่คาดว่าจะสำเร็จ",
            meaning_en: "A plan will be successful."
          }, 
          {
            period: "คืนวันจันทร์ ยามที่ 1 ยามยายี ยามศะศิ",
            period_en: "Monday 2",
            poem: "ศะศิ ยามค่ำพระสุรีย์ศรี เป็นยามดีมั่นคงไม่สงสัย
  พระเตมีย์มาเกิดกำเนิดใน ชื่นพระทัยชนนียินดีครัน",
            meaning: "เป็นยามดี ทำการงานอะไรได้รับความสะดวก",
            meaning_en: "Good time, smooth in all movements and works"
          },
          {
            period: "คืนวันอังคาร ยามที่ 1 ยามยายี ยามภุมโม",
            period_en: "Tuesday 3",
            poem: "ภุมโม ค่ำร่ำว่าให้ปรากฏ เมื่อพระรถปรีดิ์เปรมเกษมสันต์
  ขึ้นจากอุโมงค์ทรงม้าอาชาพลัน ในยามนั้นดีแท้เป็นแน่นอน",
            meaning: "เป็นยามดี จะประสบความสำเร็จ",
            meaning_en: "Good time, successful can be expected"
          },
          {
            period: "คืนวันพุธ ยามที่ 1 ยามนคร ยามพุโธ",
            period_en: "Wednesday 4",
            poem: "พุโธ โพล้เพล้จะพลบค่ำ พระลอล้ำงามเลิศดูเฉิดฉาย
  จากนครจรมาเอกากาย ค่อยผันผายตามเกาะละเมาะดง",
            meaning: "เป็นยามไม่ดี ห้ามเดินทางจะมีอันตรายรออยู่ข้างหน้า",
            meaning_en: "Bad time, dangerous to death"
          },
          {
            period: "คืนวันพฤหัส ยามที่ 1 ยามยายี ยามชีโว",
            period_en: "Thursday 5",
            poem: "ชีโว อุตโมโอฬารล้ำ เวลาค่ำยามนี้ดีหนักหนา
  ได้เมื่อพระสัชนูกุมารา อาชาพาลดเลี้ยวเที่ยวหาเมีย",
            meaning: "เป็นยามดี เดินทางดี",
            meaning_en: "good time for journey"
          },
          {
            period: "คืนวันศุกร์ ยามที่ 1 ยามยายี ยามศุกโกร",
            period_en: "Friday 6",
            poem: "ศุกโกร โอฬารมหาวิเศษ เมื่อพระเวสสันดรอนาถา
  ได้ครอบครองธานีแสนปรีดา ฝูงประชาชมชื่นทุกคืนวัน",
            meaning: "เป็นยามดี จะได้ดีมีความสุข",
            meaning_en: "Good time with happiness"
          },
          {
            period: "คืนวันเสาร์ ยามที่ 1 ยามนคร ยามโสโร",
            period_en: "Saturday 7",
            poem: "โสโร หนุมาณอันหาญกล้า รับอาสาทรงฤทธิ์อดิศร
  พบฤาษีเข้ากราบก้มประนมกร อาศัยนอนที่ศาลาในราตรี",
            meaning: "เป็นยามดี จะมีคนช่วยเหลือ อุปถัมภ์",
            meaning_en: "Good time. Supporter and helper"
          }, 
        ],

        ("19:30"..."21:00") => [
          {
            period: "คืนวันอาทิตย์ ยามที่ 2 ยามนคร ยามชีโว",
            period_en: "Sunday 5",
            poem: "ชีโว พลโห่กระหึ่มฮึก ออกสะอึกราญรบไม่หลบหนี
  ก็ยกทัพเคลื่อนคลาเข้าธานี พอถึงที่หยุดขยับตั้งทัพชัย",
            meaning: "ออกเดินทางไปแล้วดี หรือ คนที่จากไปจะกลับมา",
            meaning_en: "Good luck if a journey is happening or a lost person is coming back."
          },
          {
            period: "คืนวันจันทร์ ยามที่ 2 ยามนคร ยามศุกโกร",
            period_en: "Monday 6",
            poem: "ศุกโกร เมื่อพระองค์ทรงผนวช เป็นยิ่งยวดยอดงามยามขยัน
  ทำสิ่งไรจะสำเร็จทุกสิ่งอัน จะรำพันกายเทียบเปรียบนิทาน",
            meaning: "เป็นยามดี ทำการสิ่งใด ก็จะประสบความสำเร็จ",
            meaning_en: "Good time, successful can be expected"
          }, 
          {
            period: "คืนวันอังคาร ยามที่ 2 ยามยายี ยามโสโร",
            period_en: "Tuesday 7",
            poem: "เสาโร เมื่อพระรถยศไกร เล่นสะบ้ามีไชยสโมสร
  เป็นยามดีมีสง่าสถาพร เล่นการพนันผันผ่อนจะมีชัย",
            meaning: "เป็นยามดี ถ้ามีการแข่งขัน จะได้รับชัยชนะ การเสี่ยงโชคจะได้ ชนะพนัน",
            meaning_en: "Good time, winning the competition. Winning lotto or gambling"
          },
          {
            period: "คืนวันพุธ ยามที่ 2 ยามยายี ยามรวิ",
            period_en: "Wednesday 1",
            poem: "รวิ รอนแรมมาในป่ากว้าง ได้พบนางพี่เลี้ยงนวลระหง
  เจรจาพาทีไมตรีตรง ให้พระองค์อาศัยในอุทยาน",
            meaning: "เป็นยามดี จะได้ที่อยู่อาศัย",
            meaning_en: "Good time. New home is found"
          },
          {
            period: "คืนวันพฤหัส ยามที่ 2 ยามนคร ยามศะศิ",
            period_en: "Thursday 2",
            poem: "ศะศิ ได้พานพบประสบพักตร์ อารีรักร่วมใจจนได้เสีย
  ไม่อิ่มหนำค่ำเช้าเฝ้าคลอเคลีย หาลูกเมียยามนี้ดีสุดใจ",
            meaning: "เป็นยามดี จะได้ลาภ ได้คู่",
            meaning_en: "Good time for finding lover and fortune"
          },
          {
            period: "คืนวันศุกร์ ยามที่ 2 ยามยายี ยามภุมโม",
            period_en: "Friday 3",
            poem: "ภุมโม ยามนี้ร้ายให้ขัดขวาง ให้ทานช้างเผือกผู้ตัวขยัน
  พลเมืองเคืององค์พระทรงธรรม์ ก็ชวนกันครหาว่าไม่ดี",
            meaning: "เป็นยามร้าย จะมีคนนินทาให้ร้าย",
            meaning_en: "Bad time. People talk behind your back"
          },
          {
            period: "คืนวันเสาร์ ยามที่ 2 ยามนคร ยามพุโธ",
            period_en: "Saturday 4",
            poem: "พุโธ หนุมาณทะยานเหาะ หมายเอาเกาะลงกาอันเรืองศรี
  ก็เหาะตรงลงการาชธานี เป็นยามดีได้สมอารมณ์ลิง",
            meaning: "เป็นยามดี เดินทางไป จะประสบผลสำเร็จ",
            meaning_en: "Good time for journey to success"
          }, 
        ],

        ("21:00"..."22:30") => [
              {
            period: "คืนวันอาทิตย์ ยามที่ 3 ยามยายี ยามศะศิ",
            period_en: "Sunday 2",
            poem: "ศะศิ ตริกล่าวท้าววิเท่ห์ สมคะเนนึกพะวงให้หลงใหล
  ถึงนิเวศน์เวียงวังดังพระทัย ตามมโหสถไปไม่ช้าที",
            meaning: "จะดีร้าย ยังไม่แน่นอน",
            meaning_en: "A result is unknown, bad or good."
          }, 
          {
            period: "คืนวันจันทร์ ยามที่ 3 ยามนคร ยามภุมโม",
            period_en: "Monday 3",
            poem: "ภุมโม เตมีย์นั้นกลุ้มกลัด ไม่อยากตรัสพูดจาคำอาถรรพณ์
  สู้นิ่งเสียเพลียกายาน่าจาบัลย์ ไม่ยอมหันเห็นใครให้อดสู",
            meaning: "เป็นยามไม่ดี ทำการงานจะเกิดอุปสรรค",
            meaning_en: "Bad time, obstruct in all works"
          },
          {
            period: "คืนวันอังคาร ยามที่ 3 ยามนคร ยามพุโธ",
            period_en: "Tuesday 4",
            poem: "พุโธ โอ้พระรถยศยิ่ง ได้ทรัพย์สิ่งโภคาเป็นไหนไหน
  มาเลี้ยงพระมารดาอันยาใจ ยามนี้ไซร้ดีดอกบอกอาการ",
            meaning: "เป็นยามดี จะได้ลาภ ร่ำรวยเงินทอง",
            meaning_en: "Good time good fortune and prosperity"
          },
          {
            period: "คืนวันพุธ ยามที่ 3 ยามยายี ยามชีโว",
            period_en: "Wednesday 5",
            poem: "ชีโว ยามดีไม่มีแหนง ได้เพื่อนแพงโฉมงามทรามสงสาร
  ประคองเคียงเลี้ยงดูพระกุมาร แสนสำราญบานพระทัยไม่ไคลคลา",
            meaning: "เป็นยามดี จะได้เจอคู่ มีความสุข",
            meaning_en: "Good time. Meet a lover and happiness"
          },
          {
            period: "คืนวันพฤหัส ยามที่ 3 ยามนคร ยามศุกโกร",
            period_en: "Thursday 6",
            poem: "ศุกโกร สัชนูพคู่ชื่น เสด็จคืนภาราอันผ่องใส
  อยู่ด้วยนุชประภาผู้ยาใจ ครองเวียงไชยชื่นชมภิรมยา",
            meaning: "เป็นยามดี จะได้คู่",
            meaning_en: "Good time for finding lover"
          },
          {
            period: "คืนวันศุกร์ ยามที่ 3 ยามนคร ยามโสโร",
            period_en: "Friday 7",
            poem: "โสโร ร้ายได้เมื่อบิดาโกรธ พิฆาตโทษสำทับต้องขับหนี
  ไม่เอาไว้ไล่พรากจากบุรี ด้วยทำผิดประเวณีแต่โบราณ",
            meaning: "เป็นยามไม่ดี ถ้ามีคดีความจะแพ้ จะถูกขับไล่ พลัดพรากจากกัน",
            meaning_en: "Bad time. Lost to the lawsuit and separations"
          },
          {
            period: "คืนวันเสาร์ ยามที่ 3 ยามยายี ยามรวิ",
            period_en: "Saturday 1",
            poem: "ยามรวิ ตริตรองมองเขม้น ก็แลเห็นธิดาพระยาหญิง
  สังเกตดูยลแยบน่าแอบอิง เห็นความจริงซื่อสัตย์ต่อภัสดา",
            meaning: "เป็นยามดี จะได้พบคู่แท้ หรือ พบเพื่อนที่จริงใจต่อกัน",
            meaning_en: "Good time, meeting real love or good friends"
          }, 
        ],

        ("22:30"..."24:00") => [
          {
            period: "คืนวันอาทิตย์ ยามที่ 4 ยามยายี ยามศุกโกร",
            period_en: "Sunday 6",
            poem: "ศุกโกร โอ้ท้าวทุกข์เทวษ ทอดพระเนตรนกไม้ในไพรศรี
  คะนึงถึงลูกท้าวจุลนี จนถึงที่กองทัพพลับพลาไชย",
            meaning: "ไม่มีข่าวคราว ข้าวของหายไปยังไม่รู้ว่าไปอยู่ที่ไหน",
            meaning_en: "Neither news is coming nor lost properties are found."
          }, 
          {
            period: "คืนวันจันทร์ ยามที่ 4 ยามนคร ยามโสโร",
            period_en: "Monday 7",
            poem: "เสาโร ปางพระโพธิสัตว์นั้น เธอหมายมั่นมัธยัสถ์ไม่ถอยหนี
  เมื่อคชสารหาญกล้ามาราวี ร้ายกับดีกึ่งกันจงผันตาม",
            meaning: "เป็นยามดีร้ายก้ำกึ่งกัน จะมีคนคิดร้าย แต่ไม่สามารถทำอันตรายได้",
            meaning_en: "Half bad/good. Someone with wicked intention but it is unharm."
          },
          {
            period: "คืนวันอังคาร ยามที่ 4 ยามนคร ยามรวิ",
            period_en: "Tuesday 1",
            poem: "ยามรวิ ตริตรึกนึกประสงค์ บิตุรงค์ให้ถือหนังสือสาส์น
  หวังให้ลูกชายนั้นวายปราณ ไม่ได้การยามนี้มิดีเลย",
            meaning: "เป็นยามร้าย จะมีคนคิดทำร้าย",
            meaning_en: "Bad time. Malicer is behind"
          },
          {
            period: "คืนวันพุธ ยามที่ 4 ยามนคร ยามศะศิ",
            period_en: "Wednesday 2",
            poem: "ศะศิ ตริตรึกไม่นึกแหนง อยู่ด้วยเพื่อนกับแพงโดยหรรษา
  เกษมสรวลชวนชมภิรมยา ในมหาอุทยานสำราญพระทัย",
            meaning: "เป็นยามดี จะประสบความสำเร็จ",
            meaning_en: "Good time. Successful is expected"
          },
          {
            period: "คืนวันพฤหัส ยามที่ 4 ยามยายี ยามภุมโม",
            period_en: "Thursday 3",
            poem: "ภุมโม ชมชิดพิศวาส ด้วยนงนารถแน่งน้อยเสน่หา
  เสวยรมย์ชมสาวสวรรคยา ทั้งสองรารื่นเริงบันเทิงใจ",
            meaning: "เป็นยามดี จะมีความสุข",
            meaning_en: "Good time. A happiness time"
          },
          {
            period: "คืนวันศุกร์ ยามที่ 4 ยามยายี ยามพุโธ",
            period_en: "Friday 4",
            poem: "พุโธ โอ้นางมัทรีมิห่างผัว ยอมเอาตัวติดตามยามยุคเข็ญ
  สนองบาทบริกาคราจำเป็น ยามนี้เป็นเรื่องเศร้าอย่าเบาความ",
            meaning: "เป็นยามไม่ดี จะประสบความลำบาก มีความทุกข์",
            meaning_en: "Bad time. Suffering time"
          },
          {
            period: "คืนวันเสาร์ ยามที่ 4 ยามนคร ยามชีโว",
            period_en: "Saturday 5",
            poem: "ชีโว ยอบกายถวายแหวน สีดาแสนเศร้าสร้อยละห้อยหา
  ชลไนยไหลหลั่งดั่งธารา นางโศกาฟูมฟายแทบวายปราณ",
            meaning: "เป็นยามไม่ดี จะประสบความเสียใจ เศร้าโศก",
            meaning_en: "Bad time. Grief and sorrow is expected"
          }, 
        ],

        ("00:00"..."01:30") => [
              {
            period: "คืนวันอาทิตย์ ยามที่ 5 ยามนคร ยามภุมโม",
            period_en: "Sunday 3",
            poem: "ภุมโม โยธาสิบห้าแสน สะเทือนแผ่นโลกาสุธาไหว
  ทั้งแตรสังข์แซ่ซ้องกึกก้องไพร ก็แห่ห้อมล้อมไปถึงในเมือง",
            meaning: "หากเดินทางจะประสบความสำเร็จดี คนที่จากไปจะกลับมา"
          }, 
          {
            period: "คืนวันจันทร์ ยามที่ 5 ยามยายี ยามพุโธ",
            period_en: "Monday 4",
            poem: "พุโธ โพธิสัตว์ไม่ตรัสเหตุ พระบิตุเรศแค้นเคืองเพราะเรื่องถาม
  ให้ขุดหลุมฝังเสียจะเกลี่ยความ ด้วยเป็นยามร้ายแรงอย่าแคลงใจ",
            meaning: "เป็นยามไม่ดี จะถูกทำโทษ ถ้าเป็นความ จะแพ้คดี"
          },
          {
            period: "คืนวันอังคาร ยามที่ 5 ยามยายี ยามชีโว",
            period_en: "Tuesday 5",
            poem: "ชีโว พระฤาษีอันมีเดช ได้ทราบเหตุแปลงสาส์นเสียเฉยเฉย
  หวังจะให้ได้นางเมรีเชย พระรถเลยไปตามเป็นยามดี",
            meaning: "เป็นยามดี จะมีคนช่วยเหลือ"
          },
          {
            period: "คืนวันพุธ ยามที่ 5 ยามยายี ยามศุกโกร",
            period_en: "Wednesday 6",
            poem: "ศุกโกร โอ้ ท้าวเธอเศร้าจิต ระลึกคิดถึงมารดาน้ำตาไหล
  ไม่สู้ดียามนี้มักตรอมใจ อุประมัยเหมือนความตามนิทาน",
            meaning: "เป็นยามไม่ดี มีความทุกข์ พบอุปสรรค"
          },
          {
            period: "คืนวันพฤหัส ยามที่ 5 ยามนคร ยามโสโร",
            period_en: "Thursday 7",
            poem: "โสโร เมื่อม้าอาชาชาติ พานงนารถข้ามเขินเนินไศล
  ไปหาพระมารดาผู้ยาใจ แต่ยังไปไม่ถึงพอครึ่งทาง",
            meaning: "ถามถึงคนจากไป ออกเดินทางมาแล้ว แต่ยังมาไม่ถึง"
          },
          {
            period: "คืนวันศุกร์ ยามที่ 5 ยามยายี ยามรวิ",
            period_en: "Friday 1",
            poem: "ยามรวิ ชีชูชกไปทูลขอ สองพระหน่อวรนารถดังมาตรหมาย
  ได้แล้วพามาเมืองอันเรืองพราย ฝูงอำมาตย์ทั้งหลายก็จับพลัน",
            meaning: "เป็นยามดี สู่ขอได้จะมีลาภ ต้นดีปลายร้าย"
          },
          {
            period: "คืนวันเสาร์ ยามที่ 5 ยามนคร ยามศะศิ",
            period_en: "Saturday 2",
            poem: "ศะศิ บุตรพระพายถวายแล้ว เห็นนางแก้วโศกาน่าสงสาร
  แล้วลีลามาจากเยาวมาลย์ เข้ารุกรานหักสวนอสุรี",
            meaning: "เป็นยามไม่ดี ข้าวของเสียหาย ไม่ได้คืน"
          }, 
        ], 

        ("01:30"..."03:00") => [
              {
            period: "คืนวันอาทิตย์ ยามที่ 6 ยามนคร ยามโสโร",
            period_en: "Sunday 7",
            poem: "เสาโร รีบรุดมุดขึ้นได้ ก็จับชาวเวียงชัยมาแน่นเนือง
  ทั้งลูกสาวข้าวของก็นองเนือง ได้บ้านเมืองหมดทั่วทั้งรั้ววัง",
            meaning: "เป็นยามดี จะได้ลาภ จะประสบความสำเร็จ ของหายไปก็จะได้คืน"
          }, 
          {
            period: "คืนวันจันทร์ ยามที่ 6 ยามนคร ยามรวิ",
            period_en: "Monday 1",
            poem: "ระวิ ยามงามเลิศประเสริฐศรี พระเตมีย์แผลงศักดาสุธาไหว
  จึงตรัสสอนสารถีที่พาไป ให้อยู่ในยุติธรรมเป็นสำคัญ",
            meaning: "เป็นยามดี จะมีบารมี มีอำนาจ"
          },
          {
            period: "คืนวันอังคาร ยามที่ 6 ยามยายี ยามศะศิ",
            period_en: "Tuesday 2",
            poem: "ศะศิ หริรักษ์ประจักษ์แล้ว จึงม้าแก้วพาเหาะระเห็จหนี
  รีบข้ามฝั่งคงคาไม่ช้าที ยามนี้มีดีร้ายระคนกัน",
            meaning: "เป็นยามดีร้าย ก้ำกึ่ง หากหลบหนี จะปลอดภัย แต่หากมีคดีความจะได้รับชัยชนะ
  "
          },
          {
            period: "คืนวันพุธ ยามที่ 6 ยามยายี ยามภุมโม",
            period_en: "Wednesday 3",
            poem: "ภุมโม เมื่อพระลอเจ้าพลัดพราก กำจัดจากมารดามหาสถาน
  พระปู่เจ้าเข้าดลกมลมาร อย่าทำการยามนี้ผีคะนอง",
            meaning: "เป็นยามไม่ดี ห้ามทำการ"
          },
          {
            period: "คืนวันพฤหัส ยามที่ 6 ยามนคร ยามพุโธ",
            period_en: "Thursday 4",
            poem: "พุโธ มาอาศัยอยู่ในป่า พลัดกับม้านุชน้องยิ่งหมองหมาง
  มีโจรไพรใจกล้ามาพานาง อย่าเดินทางอันตรายจะราวี",
            meaning: "เป็นยามร้าย ถ้าออกเดินทางไป จะมีอันตราย"
          },
          {
            period: "คืนวันศุกร์ ยามที่ 6 ยามนคร ยามชีโว",
            period_en: "Friday 5",
            poem: "ชีโว ชูชกขึ้นปราสาท ไทยธิราชเลี้ยงอิ่มไม่เดียดฉันท์
  ท้องแตกตายวายชีพชีวัน ในยามนั้นว่าร้ายทำนายดู",
            meaning: "เป็นยามก้ำกึ่ง ต้นดีปลายร้าย อาจจะถึงฆาตได้ หากหลงไปกับความสุขเฉพาะหน้า"
          },
          {
            period: "คืนวันเสาร์ ยามที่ 6 ยามยายี ยามศุกโกร",
            period_en: "Saturday 6",
            poem: "ศุกโกร ฆ่ายักษ์ลงม้วยมรณ์ ข่าวขจรทราบข่าวถึงยักษี
  อึกกะทึกกึกก้อง",
            meaning: "เป็นยามไม่ดี จะโดนปองร้ายจากศัตรู"
          }, 
        ],

        ("03:00"..."04:30") => [
              {
            period: "คืนวันอาทิตย์ ยามที่ 7 ยามยายี ยามพุโธ",
            period_en: "Sunday 4",
            poem: "พุโธ โอ้ท้าวจุลนีราช แพ้เจ้าปราชญ์คิดไว้ไม่สมหวัง
  เธอเสียลูกเสียเมียเสียเวียงวัง เสียทั้งไพร่ทั้งพลแลมนตรี",
            meaning: "เป็นยามไม่ดี หากมีคดีความจะแพ้ ข้าวของเสียหาย ไม่ได้คืน"
          }, 
          {
            period: "คืนวันจันทร์ ยามที่ 7 ยามนคร ยามชีโว",
            period_en: "Monday 5",
            poem: "ชีโว โพธิสัตว์ตรัสรู้ ได้เป็นครูสิ้นสุดมนุษย์สวรรค์
  ในยามนี้ดีเลิศประเสริฐครัน เป็นมหัสตะมหาโอฬาฬาร",
            meaning: "เป็นยามดี จะประสบความสำเร็จทุกประการ"
          },
          {
            period: "คืนวันอังคาร ยามที่ 7 ยามนคร ยามศุกโกร",
            period_en: "Tuesday 6",
            poem: "ศุกโกร เมื่อเมรีไม่เห็นผัว ให้หมองมัวตามหาจนอาสัญ
  มายามนี้ไซร้อย่าได้จรจรัล อย่าผูกพันไมตรีจะมีภัย",
            meaning: "เป็นยามร้าย ของที่หายไปไม่ได้คืน หากเดินทางจะมีอันตราย"
          },
          {
            period: "คืนวันพุธ ยามที่ 7 ยามยายี ยามโสโร",
            period_en: "Wednesday 7",
            poem: "โสโร พระลอวรนาถ คิดถึงนุชสุดสวาทเจ้าทั้งสอง
  ก็จรจากมารดามาหาน้อง ยามนี้ต้องต้นร้ายข้างปลายดี",
            meaning: "เป็นยามก้ำกึ่ง ต้นร้าย แต่ปลายดี"
          },
          {
            period: "คืนวันพฤหัส ยามที่ 7 ยามยายี ยามรวิ",
            period_en: "Thursday 1",
            poem: "รวิ นางนงเยาว์สำเภาแตก ลำบากกายว่ายแหวกวารีศรี
  ห้ามมิให้เดินทางกลางนที เหตุจะมีเหมือนกันดังพรรณนา",
            meaning: "เป็นยามร้าย ห้ามเดินทางทางเรือ ไปแล้วจะมีเคราะห์"
          },
          {
            period: "คืนวันศุกร์ ยามที่ 7 ยามนคร ยามศะศิ",
            period_en: "Friday 2",
            poem: "ศะศิ เกณฑ์ช้างม้าโยธาทัพ ออกไปรับเวสสันดรที่บวชอยู่
  ทั้งไพร่พลแห่ห้อมล้อมพรั่งพรู เสด็จสู่กรุงศรีบุรีรมย์",
            meaning: "เป็นยามดี คนที่จากไปจะกลับมา มีโชคดี"
          },
          {
            period: "คืนวันเสาร์ ยามที่ 7 ยามนคร ยามภุมโม",
            period_en: "Saturday 3",
            poem: "ภุมโม อินทรชิตรับอาสา ก็รีบมาสวนขวัญปะลิงใหญ่
  จึงแผลงศรจับตัววานรได้ แล้วนำไปถวายพระบิดา",
            meaning: "เป็นยามไม่ดี จะแพ้ภัย"
          }, 
        ],

        ("04:30"..."06:00") => [
              {
            period: "คืนวันอาทิตย์ ยามที่ 8 ยามรวิ",
            period_en: "Sunday 1",
            poem: "รวิ งามยามสุดปัจจุสมัย จวนจะใกล้รุ่งสางสว่างศรี
  ได้เมื่อครั้งองค์ท้าวจุลนี เธอเสียทีย่อยยับอัปรา",
            meaning: "เป็นยามไม่ดี ไม่มีลาภ การงานยังไม่ประสบผล ทำอะไรไม่ประสบความสำเร็จ"
          }, 
          {
            period: "คืนวันจันทร์ ยามที่ 8 ยามศะศิ",
            period_en: "Monday 2",
            poem: "ศะศิ ค่อนรุ่งอร่ามศรี เป็นยามดีสารพรรณดังบรรหาร
  เมื่อพระองค์ทรงบำเพ็ญโพธิญาณ จงโปรดปรานสรรพสัตว์ในโลกา",
            meaning: "เป็นยามดีมาก"
          },
          {
            period: "คืนวันอังคาร ยามที่ 8 ยามภุมโม",
            period_en: "Tuesday 3",
            poem: "ภุมโม เมื่ออาชาพาพระรถ ข้ามบรรพตโขดเขินเนินไศล
  ถึงเมืองบิดานราไทย สำราญใจพระรถยศยง",
            meaning: "เป็นยามดี คิดทำงานสิ่งใด จะประสบผลสำเร็จ"
          },
          {
            period: "คืนวันพุธ ยามที่ 8 ยามพุโธ",
            period_en: "Wednesday 4",
            poem: "พุโธ เมื่อพระลอดิลกภพ มาประสพสมนางอยู่ปรางศรี
  สุขเกษมเปรมปราทุกราตรี เป็นยามดีจงจำซึ่งตำรา",
            meaning: "เป็นยามดี จะประสบความสำเร็จ ได้คู่"
          },
          {
            period: "คืนวันพฤหัส ยามที่ 8 ยามชีโว",
            period_en: "Thursday 5",
            poem: "ชีโว สุริโยวโรภาส อนงค์นารถเดินไพรไกลหนักหนา
  ได้พบกับพาชีแสนปรีดา ก็ชักพากันไปดังใจปอง",
            meaning: "เป็นยามดี จะได้ลาภสมปรารถนา"
          },
          {
            period: "คืนวันศุกร์ ยามที่ 8 ยามศุกโกร",
            period_en: "Friday 6",
            poem: "ศุกโกร พระบิดาราชาภิเษก เป็นจอมเอกองค์กษัตริย์อันสูงสม
  เฉลิมมิ่งมงกุฎอันอุดม เป็นบรมสุโขภิญโญยศ",
            meaning: "เป็นยามดีมาก"
          },
          {
            period: "คืนวันเสาร์ ยามที่ 8 ยามโสโร",
            period_en: "Saturday 7",
            poem: "โสโร เกือบใกล้อรุณรุ่ง หนุมาณเผากรุงท้าวยักษา
  อัฏฐกาลสองสถานรำพันมา แม้นยาตราเลือกเดินดำเนินเอย",
            meaning: "เป็นยามไม่ดี ระวังไฟไหม้ จะสูญเสียทรัพย์สิน บ้านช่อง"
          }, 
        ],

      }
    end
  end
end
